[
  {
    "projectDesc": "五口2位200电磁阀",
    "indexPartNo": "UC3030004041",
    "indexPartDesc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口二位單電控;接口管徑:PT1/8;型號:VS2120-01;品牌:紐立得",
    "requiredGroups": [
      {
        "groupName": "接头",
        "number": 2.0,
        "choices": [
          {
            "partNo": "UC3030021057",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/8;接管口徑:φ6;規格:螺紋直通;型號:PPC601;品牌:紐立得"
          },
          {
            "partNo": "UC3030021086",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/8;接管口徑:φ4;規格:螺紋直通;型號:PPC401;品牌:紐立得"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "五口3位中封200电磁阀",
    "indexPartNo": "UC3030004043",
    "indexPartDesc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口三位中封;接口管徑:PT1/8;型號:VS2320-01;品牌:紐立得",
    "requiredGroups": [
      {
        "groupName": "接头",
        "number": 2.0,
        "choices": [
          {
            "partNo": "UC3030021057",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/8;接管口徑:φ6;規格:螺紋直通;型號:PPC601;品牌:紐立得"
          },
          {
            "partNo": "UC3030021086",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/8;接管口徑:φ4;規格:螺紋直通;型號:PPC401;品牌:紐立得"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "五口2位400电磁阀",
    "indexPartNo": "UC3030004054",
    "indexPartDesc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口二位單電控;接口管徑:PT1/2;型號:VS4120-04;品牌:紐立得",
    "requiredGroups": [
      {
        "groupName": "接头",
        "number": 2.0,
        "choices": [
          {
            "partNo": "UC3030021078",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/2;接管口徑:φ10;規格:螺紋直通;型號:PPC1004;品牌:紐立得"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "2位200阀导",
    "indexPartNo": "UC3030004078",
    "indexPartDesc": "原材料;電控外購件;氣類;氣動控制;匯流板;型號:200M2F;品牌:紐立得",
    "requiredGroups": [
      {
        "groupName": "进气接头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030021069",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ12;規格:螺紋直通;型號:PPC1202;品牌:紐立得"
          },
          {
            "partNo": "UC3030021070",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ10;規格:L型螺紋二通;型號:PPL1002;品牌:紐立得"
          },
          {
            "partNo": "UC3030021073",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ12;規格:L型螺紋二通;型號:PPL1202;品牌:紐立得"
          },
          {
            "partNo": "UC3030021085",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ10;規格:螺紋直通;型號:PPC1002;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "消音器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040028",
            "desc": "原材料;電控外購件;氣類;輔助元件;消聲器;型號:BSLM02;品牌:紐立得",
            "number": 4.0
          }
        ]
      },
      {
        "groupName": "堵头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040027",
            "desc": "原材料;電控外購件;氣類;輔助元件;堵頭;型號:SP01-02S;品牌:紐立得"
          },
          {
            "partNo": "UC3030021055",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ6;規格:螺紋直通;型號:PPC602;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "电磁阀",
        "number": 2.0,
        "choices": [
          {
            "partNo": "UC3030004041",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口二位單電控;接口管徑:PT1/8;型號:VS2120-01;品牌:紐立得"
          },
          {
            "partNo": "UC3030004043",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口三位中封;接口管徑:PT1/8;型號:VS2320-01;品牌:紐立得"
          },
          {
            "partNo": "UC3030000031",
            "desc": "原材料;電控外購件;氣類;氣動控制;盲板;型號:P-200M-R2;品牌:耶诺"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "3位200阀导",
    "indexPartNo": "UC3030004047",
    "indexPartDesc": "原材料;電控外購件;氣類;氣動控制;匯流板;型號:200M3F;品牌:紐立得",
    "requiredGroups": [
      {
        "groupName": "进气接头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030021069",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ12;規格:螺紋直通;型號:PPC1202;品牌:紐立得"
          },
          {
            "partNo": "UC3030021070",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ10;規格:L型螺紋二通;型號:PPL1002;品牌:紐立得"
          },
          {
            "partNo": "UC3030021073",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ12;規格:L型螺紋二通;型號:PPL1202;品牌:紐立得"
          },
          {
            "partNo": "UC3030021085",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ10;規格:螺紋直通;型號:PPC1002;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "消音器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040028",
            "desc": "原材料;電控外購件;氣類;輔助元件;消聲器;型號:BSLM02;品牌:紐立得",
            "number": 4.0
          }
        ]
      },
      {
        "groupName": "堵头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040027",
            "desc": "原材料;電控外購件;氣類;輔助元件;堵頭;型號:SP01-02S;品牌:紐立得"
          },
          {
            "partNo": "UC3030021055",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ6;規格:螺紋直通;型號:PPC602;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "电磁阀",
        "number": 3.0,
        "choices": [
          {
            "partNo": "UC3030004041",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口二位單電控;接口管徑:PT1/8;型號:VS2120-01;品牌:紐立得"
          },
          {
            "partNo": "UC3030004043",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口三位中封;接口管徑:PT1/8;型號:VS2320-01;品牌:紐立得"
          },
          {
            "partNo": "UC3030000031",
            "desc": "原材料;電控外購件;氣類;氣動控制;盲板;型號:P-200M-R2;品牌:耶诺"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "4位200阀导",
    "indexPartNo": "UC3030004045",
    "indexPartDesc": "原材料;電控外購件;氣類;氣動控制;匯流板;型號:200M4F;品牌:紐立得",
    "requiredGroups": [
      {
        "groupName": "进气接头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030021069",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ12;規格:螺紋直通;型號:PPC1202;品牌:紐立得"
          },
          {
            "partNo": "UC3030021070",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ10;規格:L型螺紋二通;型號:PPL1002;品牌:紐立得"
          },
          {
            "partNo": "UC3030021073",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ12;規格:L型螺紋二通;型號:PPL1202;品牌:紐立得"
          },
          {
            "partNo": "UC3030021085",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ10;規格:螺紋直通;型號:PPC1002;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "消音器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040028",
            "desc": "原材料;電控外購件;氣類;輔助元件;消聲器;型號:BSLM02;品牌:紐立得",
            "number": 4.0
          }
        ]
      },
      {
        "groupName": "堵头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040027",
            "desc": "原材料;電控外購件;氣類;輔助元件;堵頭;型號:SP01-02S;品牌:紐立得"
          },
          {
            "partNo": "UC3030021055",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ6;規格:螺紋直通;型號:PPC602;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "电磁阀",
        "number": 4.0,
        "choices": [
          {
            "partNo": "UC3030004041",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口二位單電控;接口管徑:PT1/8;型號:VS2120-01;品牌:紐立得"
          },
          {
            "partNo": "UC3030004043",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口三位中封;接口管徑:PT1/8;型號:VS2320-01;品牌:紐立得"
          },
          {
            "partNo": "UC3030000031",
            "desc": "原材料;電控外購件;氣類;氣動控制;盲板;型號:P-200M-R2;品牌:耶诺"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "6位200阀导",
    "indexPartNo": "UC3030004050",
    "indexPartDesc": "原材料;電控外購件;氣類;氣動控制;匯流板;型號:200M6F;品牌:紐立得",
    "requiredGroups": [
      {
        "groupName": "进气接头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030021069",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ12;規格:螺紋直通;型號:PPC1202;品牌:紐立得"
          },
          {
            "partNo": "UC3030021070",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ10;規格:L型螺紋二通;型號:PPL1002;品牌:紐立得"
          },
          {
            "partNo": "UC3030021073",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ12;規格:L型螺紋二通;型號:PPL1202;品牌:紐立得"
          },
          {
            "partNo": "UC3030021085",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ10;規格:螺紋直通;型號:PPC1002;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "消音器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040028",
            "desc": "原材料;電控外購件;氣類;輔助元件;消聲器;型號:BSLM02;品牌:紐立得",
            "number": 4.0
          }
        ]
      },
      {
        "groupName": "堵头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040027",
            "desc": "原材料;電控外購件;氣類;輔助元件;堵頭;型號:SP01-02S;品牌:紐立得"
          },
          {
            "partNo": "UC3030021055",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ6;規格:螺紋直通;型號:PPC602;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "电磁阀",
        "number": 6.0,
        "choices": [
          {
            "partNo": "UC3030004041",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口二位單電控;接口管徑:PT1/8;型號:VS2120-01;品牌:紐立得"
          },
          {
            "partNo": "UC3030004043",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口三位中封;接口管徑:PT1/8;型號:VS2320-01;品牌:紐立得"
          },
          {
            "partNo": "UC3030000031",
            "desc": "原材料;電控外購件;氣類;氣動控制;盲板;型號:P-200M-R2;品牌:耶诺"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "8位200阀导",
    "indexPartNo": "UC3030004055",
    "indexPartDesc": "原材料;電控外購件;氣類;氣動控制;匯流板;型號:200M8F;品牌:紐立得",
    "requiredGroups": [
      {
        "groupName": "进气接头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030021069",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ12;規格:螺紋直通;型號:PPC1202;品牌:紐立得"
          },
          {
            "partNo": "UC3030021070",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ10;規格:L型螺紋二通;型號:PPL1002;品牌:紐立得"
          },
          {
            "partNo": "UC3030021073",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ12;規格:L型螺紋二通;型號:PPL1202;品牌:紐立得"
          },
          {
            "partNo": "UC3030021085",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ10;規格:螺紋直通;型號:PPC1002;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "消音器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040028",
            "desc": "原材料;電控外購件;氣類;輔助元件;消聲器;型號:BSLM02;品牌:紐立得",
            "number": 4.0
          }
        ]
      },
      {
        "groupName": "堵头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040027",
            "desc": "原材料;電控外購件;氣類;輔助元件;堵頭;型號:SP01-02S;品牌:紐立得"
          },
          {
            "partNo": "UC3030021055",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/4;接管口徑:φ6;規格:螺紋直通;型號:PPC602;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "电磁阀",
        "number": 8.0,
        "choices": [
          {
            "partNo": "UC3030004041",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口二位單電控;接口管徑:PT1/8;型號:VS2120-01;品牌:紐立得"
          },
          {
            "partNo": "UC3030004043",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口三位中封;接口管徑:PT1/8;型號:VS2320-01;品牌:紐立得"
          },
          {
            "partNo": "UC3030000031",
            "desc": "原材料;電控外購件;氣類;氣動控制;盲板;型號:P-200M-R2;品牌:耶诺"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "2位400阀导",
    "indexPartNo": "UC3030004053",
    "indexPartDesc": "原材料;電控外購件;氣類;氣動控制;匯流板;型號:400M2F;品牌:紐立得",
    "requiredGroups": [
      {
        "groupName": "进气接头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030021078",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/2;接管口徑:φ10;規格:螺紋直通;型號:PPC1004;品牌:紐立得"
          },
          {
            "partNo": "UC3030021096",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/2;接管口徑:φ10;規格:L型螺紋二通;型號:PPL1004;品牌:紐立得"
          },
          {
            "partNo": "UC3030021091",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/2;接管口徑:φ12;規格:L型螺紋二通;型號:PPL1204;品牌:紐立得"
          },
          {
            "partNo": "UC3030021074",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/2;接管口徑:φ12;規格:螺紋直通;型號:PPC1204;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "消音器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040031",
            "desc": "原材料;電控外購件;氣類;輔助元件;消聲器;型號:BSLM04;品牌:紐立得",
            "number": 4.0
          }
        ]
      },
      {
        "groupName": "堵头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040032",
            "desc": "原材料;電控外購件;氣類;輔助元件;堵頭;型號:SP01-04S;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "电磁阀",
        "number": 2.0,
        "choices": [
          {
            "partNo": "UC3030004054",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口二位單電控;接口管徑:PT1/2;型號:VS4120-04;品牌:紐立得"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "3位400阀导",
    "indexPartNo": "UC3030004091",
    "indexPartDesc": "原材料;電控外購件;氣類;氣動控制;匯流板;型號:400M3F;品牌:紐立得",
    "requiredGroups": [
      {
        "groupName": "进气接头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030021078",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/2;接管口徑:φ10;規格:螺紋直通;型號:PPC1004;品牌:紐立得"
          },
          {
            "partNo": "UC3030021096",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/2;接管口徑:φ10;規格:L型螺紋二通;型號:PPL1004;品牌:紐立得"
          },
          {
            "partNo": "UC3030021091",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/2;接管口徑:φ12;規格:L型螺紋二通;型號:PPL1204;品牌:紐立得"
          },
          {
            "partNo": "UC3030021074",
            "desc": "原材料;電控外購件;氣類;管接頭;氣管接頭;連接螺紋:PT1/2;接管口徑:φ12;規格:螺紋直通;型號:PPC1204;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "消音器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040031",
            "desc": "原材料;電控外購件;氣類;輔助元件;消聲器;型號:BSLM04;品牌:紐立得",
            "number": 4.0
          }
        ]
      },
      {
        "groupName": "堵头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3030040032",
            "desc": "原材料;電控外購件;氣類;輔助元件;堵頭;型號:SP01-04S;品牌:紐立得"
          }
        ]
      },
      {
        "groupName": "电磁阀",
        "number": 3.0,
        "choices": [
          {
            "partNo": "UC3030004054",
            "desc": "原材料;電控外購件;氣類;氣動控制;電磁閥;電壓:DC24V;分類:五口二位單電控;接口管徑:PT1/2;型號:VS4120-04;品牌:紐立得"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "汇川100w无刹车电机",
    "indexPartNo": "UC3010010034",
    "indexPartDesc": "原材料;電控外購件;執行元件;伺服電機;型號:MS1H1-10B30CB-T330ZX6;功率:100W;是否带制动:否;品牌:匯川",
    "requiredGroups": [
      {
        "groupName": "驱动器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3000040020",
            "desc": "原材料;電控外購件;控制類;伺服驅動器;電壓:220V;功率:100W;型號:SV630CS1R6I;品牌:匯川"
          }
        ]
      },
      {
        "groupName": "动力线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040075",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:5M;特性:抗拖拉;型號:S6-L-M107-5.0-T;品牌:匯川;說明:不帶剎車"
          },
          {
            "partNo": "UC3070040163",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:10M;特性:抗拖拉;型號:S6-L-M107-10.0-T;品牌:匯川;說明:不帶剎車"
          }
        ]
      },
      {
        "groupName": "编码器线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040077",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:5M;特性:抗拖拉;型號:S6-L-P124-5.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          },
          {
            "partNo": "UC3070040097",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:10M;特性:抗拖拉;型號:S6-L-P124-10.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          }
        ]
      },
      {
        "groupName": "I/O插头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020000071",
            "desc": "原材料;電控外購件;配線周邊;電線連接器;直通型;芯數:44;外形樣式:插針;最大電流:無;型號:S6-C8;品牌:匯川",
            "conditionMode": "NOTANY",
            "conditionPartNos": [
              "UC3000020005"
            ]
          }
        ]
      },
      {
        "groupName": "电池",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020100004",
            "desc": "原材料;電控外購件;配線周邊;電池;型號:S6-C4;品牌:匯川;電壓:3.6V",
            "conditionMode": "ANY",
            "conditionPartNos": [
              "UC3000020005"
            ]
          }
        ]
      },
      {
        "groupName": "网线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040140",
            "desc": "原材料;電控外購件;配線;專用控制連接線;數據通訊線;長度:0.5M;特性:抗干擾;型號:六類千兆-黑-0.5M;品牌:山澤;說明:成品網線"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "汇川100w带刹车电机",
    "indexPartNo": "UC3010010035",
    "indexPartDesc": "原材料;電控外購件;執行元件;伺服電機;型號:MS1H1-10B30CB-T332ZX6;功率:100W;是否带制动:是;品牌:匯川",
    "requiredGroups": [
      {
        "groupName": "驱动器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3000040020",
            "desc": "原材料;電控外購件;控制類;伺服驅動器;電壓:220V;功率:100W;型號:SV630CS1R6I;品牌:匯川"
          }
        ]
      },
      {
        "groupName": "动力线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040076",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:5M;特性:抗拖拉;型號:S6-L-B107-5.0-T;品牌:匯川;說明:帶剎車"
          },
          {
            "partNo": "UC3070040096",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:10M;特性:抗拖拉;型號:S6-L-B107-10.0-T;品牌:匯川;說明:帶剎車"
          }
        ]
      },
      {
        "groupName": "编码器线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040077",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:5M;特性:抗拖拉;型號:S6-L-P124-5.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          },
          {
            "partNo": "UC3070040097",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:10M;特性:抗拖拉;型號:S6-L-P124-10.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          }
        ]
      },
      {
        "groupName": "IO插头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020000071",
            "desc": "原材料;電控外購件;配線周邊;電線連接器;直通型;芯數:44;外形樣式:插針;最大電流:無;型號:S6-C8;品牌:匯川"
          }
        ]
      },
      {
        "groupName": "电池",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020100004",
            "desc": "原材料;電控外購件;配線周邊;電池;型號:S6-C4;品牌:匯川;電壓:3.6V",
            "conditionMode": "ANY",
            "conditionPartNos": [
              "UC3000020005"
            ]
          }
        ]
      },
      {
        "groupName": "网线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040140",
            "desc": "原材料;電控外購件;配線;專用控制連接線;數據通訊線;長度:0.5M;特性:抗干擾;型號:六類千兆-黑-0.5M;品牌:山澤;說明:成品網線"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "汇川400w无刹车电机",
    "indexPartNo": "UC3010010032",
    "indexPartDesc": "原材料;電控外購件;執行元件;伺服電機;型號:MS1H4-40B30CB-T331ZX6;功率:400W;是否带制动:否;品牌:匯川",
    "requiredGroups": [
      {
        "groupName": "驱动器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3000040019",
            "desc": "原材料;電控外購件;控制類;伺服驅動器;電壓:220V;功率:400W;型號:SV630CS2R8I;品牌:匯川"
          }
        ]
      },
      {
        "groupName": "动力线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040075",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:5M;特性:抗拖拉;型號:S6-L-M107-5.0-T;品牌:匯川;說明:不帶剎車"
          },
          {
            "partNo": "UC3070040163",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:10M;特性:抗拖拉;型號:S6-L-M107-10.0-T;品牌:匯川;說明:不帶剎車"
          }
        ]
      },
      {
        "groupName": "编码器线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040077",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:5M;特性:抗拖拉;型號:S6-L-P124-5.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          },
          {
            "partNo": "UC3070040097",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:10M;特性:抗拖拉;型號:S6-L-P124-10.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          }
        ]
      },
      {
        "groupName": "I/O插头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020000071",
            "desc": "原材料;電控外購件;配線周邊;電線連接器;直通型;芯數:44;外形樣式:插針;最大電流:無;型號:S6-C8;品牌:匯川",
            "conditionMode": "NOTANY",
            "conditionPartNos": [
              "UC3000020005"
            ]
          }
        ]
      },
      {
        "groupName": "电池",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020100004",
            "desc": "原材料;電控外購件;配線周邊;電池;型號:S6-C4;品牌:匯川;電壓:3.6V",
            "conditionMode": "ANY",
            "conditionPartNos": [
              "UC3000020005"
            ]
          }
        ]
      },
      {
        "groupName": "网线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040140",
            "desc": "原材料;電控外購件;配線;專用控制連接線;數據通訊線;長度:0.5M;特性:抗干擾;型號:六類千兆-黑-0.5M;品牌:山澤;說明:成品網線"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "汇川400w带刹车电机",
    "indexPartNo": "UC3010010033",
    "indexPartDesc": "原材料;電控外購件;執行元件;伺服電機;型號:MS1H4-40B30CB-T334ZX6;功率:400W;是否带制动:是;品牌:匯川",
    "requiredGroups": [
      {
        "groupName": "驱动器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3000040019",
            "desc": "原材料;電控外購件;控制類;伺服驅動器;電壓:220V;功率:400W;型號:SV630CS2R8I;品牌:匯川"
          }
        ]
      },
      {
        "groupName": "动力线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040076",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:5M;特性:抗拖拉;型號:S6-L-B107-5.0-T;品牌:匯川;說明:帶剎車"
          },
          {
            "partNo": "UC3070040096",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:10M;特性:抗拖拉;型號:S6-L-B107-10.0-T;品牌:匯川;說明:帶剎車"
          }
        ]
      },
      {
        "groupName": "编码器线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040077",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:5M;特性:抗拖拉;型號:S6-L-P124-5.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          },
          {
            "partNo": "UC3070040097",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:10M;特性:抗拖拉;型號:S6-L-P124-10.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          }
        ]
      },
      {
        "groupName": "IO插头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020000071",
            "desc": "原材料;電控外購件;配線周邊;電線連接器;直通型;芯數:44;外形樣式:插針;最大電流:無;型號:S6-C8;品牌:匯川"
          }
        ]
      },
      {
        "groupName": "电池",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020100004",
            "desc": "原材料;電控外購件;配線周邊;電池;型號:S6-C4;品牌:匯川;電壓:3.6V",
            "conditionMode": "ANY",
            "conditionPartNos": [
              "UC3000020005"
            ]
          }
        ]
      },
      {
        "groupName": "网线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040140",
            "desc": "原材料;電控外購件;配線;專用控制連接線;數據通訊線;長度:0.5M;特性:抗干擾;型號:六類千兆-黑-0.5M;品牌:山澤;說明:成品網線"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "汇川750w无刹车电机",
    "indexPartNo": "UC3010010036",
    "indexPartDesc": "原材料;電控外購件;執行元件;伺服電機;型號:MS1H4-75B30CB-T331ZX6;功率:750W;是否带制动:否;品牌:匯川",
    "requiredGroups": [
      {
        "groupName": "驱动器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3000040021",
            "desc": "原材料;電控外購件;控制類;伺服驅動器;電壓:220V;功率:750W;型號:SV630CS5R5I;品牌:匯川"
          }
        ]
      },
      {
        "groupName": "动力线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040075",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:5M;特性:抗拖拉;型號:S6-L-M107-5.0-T;品牌:匯川;說明:不帶剎車"
          },
          {
            "partNo": "UC3070040163",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:10M;特性:抗拖拉;型號:S6-L-M107-10.0-T;品牌:匯川;說明:不帶剎車"
          }
        ]
      },
      {
        "groupName": "编码器线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040077",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:5M;特性:抗拖拉;型號:S6-L-P124-5.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          },
          {
            "partNo": "UC3070040097",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:10M;特性:抗拖拉;型號:S6-L-P124-10.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          }
        ]
      },
      {
        "groupName": "I/O插头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020000071",
            "desc": "原材料;電控外購件;配線周邊;電線連接器;直通型;芯數:44;外形樣式:插針;最大電流:無;型號:S6-C8;品牌:匯川",
            "conditionMode": "NOTANY",
            "conditionPartNos": [
              "UC3000020005"
            ]
          }
        ]
      },
      {
        "groupName": "电池",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020100004",
            "desc": "原材料;電控外購件;配線周邊;電池;型號:S6-C4;品牌:匯川;電壓:3.6V",
            "conditionMode": "ANY",
            "conditionPartNos": [
              "UC3000020005"
            ]
          }
        ]
      },
      {
        "groupName": "网线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040140",
            "desc": "原材料;電控外購件;配線;專用控制連接線;數據通訊線;長度:0.5M;特性:抗干擾;型號:六類千兆-黑-0.5M;品牌:山澤;說明:成品網線"
          }
        ]
      }
    ]
  },
  {
    "projectDesc": "汇川750w带刹车电机",
    "indexPartNo": "UC3010010038",
    "indexPartDesc": "原材料;電控外購件;執行元件;伺服電機;型號:MS1H4-75B30CB-T334ZX6;功率:750W;是否带制动:是;品牌:匯川",
    "requiredGroups": [
      {
        "groupName": "驱动器",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3000040021",
            "desc": "原材料;電控外購件;控制類;伺服驅動器;電壓:220V;功率:750W;型號:SV630CS5R5I;品牌:匯川"
          }
        ]
      },
      {
        "groupName": "动力线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040076",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:5M;特性:抗拖拉;型號:S6-L-B107-5.0-T;品牌:匯川;說明:帶剎車"
          },
          {
            "partNo": "UC3070040096",
            "desc": "原材料;電控外購件;配線;專用控制連接線;動力線;長度:10M;特性:抗拖拉;型號:S6-L-B107-10.0-T;品牌:匯川;說明:帶剎車"
          }
        ]
      },
      {
        "groupName": "编码器线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040077",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:5M;特性:抗拖拉;型號:S6-L-P124-5.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          },
          {
            "partNo": "UC3070040097",
            "desc": "原材料;電控外購件;配線;專用控制連接線;編碼器線;長度:10M;特性:抗拖拉;型號:S6-L-P124-10.0-T;品牌:匯川;說明:匯川伺服絕對值編碼器線"
          }
        ]
      },
      {
        "groupName": "IO插头",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020000071",
            "desc": "原材料;電控外購件;配線周邊;電線連接器;直通型;芯數:44;外形樣式:插針;最大電流:無;型號:S6-C8;品牌:匯川"
          }
        ]
      },
      {
        "groupName": "电池",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3020100004",
            "desc": "原材料;電控外購件;配線周邊;電池;型號:S6-C4;品牌:匯川;電壓:3.6V",
            "conditionMode": "ANY",
            "conditionPartNos": [
              "UC3000020005"
            ]
          }
        ]
      },
      {
        "groupName": "网线",
        "number": 1.0,
        "choices": [
          {
            "partNo": "UC3070040140",
            "desc": "原材料;電控外購件;配線;專用控制連接線;數據通訊線;長度:0.5M;特性:抗干擾;型號:六類千兆-黑-0.5M;品牌:山澤;說明:成品網線"
          }
        ]
      }
    ]
  }
]